ws-asahi/UkiUkiCore/megaavr/variants/UkiUkiduino/pins_arduino.h
/* =================================================================
 *  Serial -> native USB CDC   (Leonardo/Micro convention)
 * =================================================================
 *  Serial  = USBSerial (on-chip USB CDC)              <- primary / USB serial monitor
 *  Serial1 = USART0   (D0/D1, ALT1 - the Uno R3 hardware UART; Uno R4 naming.
 *                      Alias of Serial0 - both names reach the same port.)
 *  Serial2 = USART1   (D13 TX / D20(AREF) RX, ALT2 - shares pins with SPI0
 *                      SCK and the AREF function; see the USART1 note above).
 *  Define HAVE_NO_USB_SERIAL_REDIRECT (from boards.txt) to keep Serial==USART0.
 */
#if defined(USB0) && !defined(HAVE_NO_USB_SERIAL_REDIRECT)
  #ifndef Serial
    #define Serial                  USBSerial   /* Serial = native USB CDC   */
  #endif
  #ifndef SERIAL_PORT_MONITOR
    #define SERIAL_PORT_MONITOR     Serial
  #endif
  #ifndef SERIAL_PORT_USBVIRTUAL
    #define SERIAL_PORT_USBVIRTUAL  Serial
  #endif
  #ifndef SERIAL_PORT_HARDWARE
    #define SERIAL_PORT_HARDWARE    Serial1     /* Uno R3 D0/D1 hardware UART (USART0) */
  #endif
#endif

/* ---- analogReference(EXTERNAL) is available: PD7 (VREFA) is wired to the
 * AREF header pin, exactly like the Uno R3 - but unlike the Uno R3 the pin
 * doubles as GPIO D20/A20 (and SPI0 hardware SS / Serial2 RX) whenever no
 * external reference is in use. Do not drive D20 as an output while a shield
 * feeds a reference into AREF, and do not select EXTERNAL while D20 is an
 * output. ---- */

#endif
